Repository: RanaHossam/n-queens-puzzle
Catalog: QueensPuzzle/Resources/Localizable.xcstrings
Source language: en
Languages: ar

# abandon_game_message
source: By starting a new game, all your previous progress will be lost.
ar: سيؤدي بدء لعبة جديدة إلى فقدان تقدمك السابق.

# abandon_game_title
source: Abandon last game?
ar: هل تريد التخلي عن اللعبة الحالية؟

# amethyst_title
source: Amethyst
ar: أرجواني

# best_time_label
source: Best: %@
ar: الأفضل: %@

source: Best Times
ar: أفضل الأوقات

source: Cancel
ar: إلغاء

# classic_title
source: Classic
ar: كلاسيكي

# continue_title
source: Continue Game
ar: متابعة اللعبة

# done_title
source: Done
ar: تم

# help_info
source: Place one queen per row and column. Queens may not touch each other.
ar: ضع ملكة واحدة في كل صف وعمود. لا يجوز أن تلمس الملكات بعضها.

# nav_title_format
source: %1$lld×%2$lld Queens
ar: %1$lld×%2$lld ملكات

source: New Game
ar: لعبة جديدة

source: New Personal Best!
ar: رقم قياسي شخصي جديد!

# ocean_title
source: Ocean
ar: أزرق

# queens_left_format
source: %lld left
ar: %lld متبقية

source: Queens Remaining
ar: الملكات المتبقية

# queens_title
source: N-Queens
ar: مسألة الملكات

# reset_button
source: Reset
ar: إعادة تعيين

source: Reset Puzzle
ar: إعادة تعيين الأحجية

# settings_title
source: Settings
ar: الإعدادات

# solved_title
source: Puzzle Solved!
ar: تم حل الأحجية!
